In [12]:
# QUESTION 4
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
# a) i)
df=pd.read_csv('sales_data.csv')
df

    Transaction_ID  Product_ID        Date  Quantity      Price  Customer_ID
0                1           4  2023-02-04         7  63.180365           10
1                2           5  2023-05-03         9  70.980793            3
2                3           3  2022-12-18         8  11.492905           18
3                4           5  2023-01-20         2  56.088375           13
4                5           5  2023-05-10         1  30.384620            7
..             ...         ...         ...       ...        ...          ...
95              96           3  2023-01-07         6  88.963576           20
96              97           5  2023-11-11         1  76.669176           12
97              98           2  2023-06-07         9  72.731417           18
98              99           2  2023-09-03         6  73.223568            3
99             100           1  2023-11-16         3  42.354204            1

[100 rows x 6 columns]

In [6]:
df1=pd.read_csv('products.csv')
df1

   Product_ID Product_Name
0           1         Milk
1           2     Biscuits
2           3       Coffee
3           4         Meat
4           5      Noodles

In [9]:
total_sales_revenue=df['Price']*df['Quantity']

In [10]:
total_sales_revenue

0     442.262554
1     638.827133
2      91.943237
3     112.176750
4      30.384620
         ...
95    533.781459
96     76.669176
97    654.582750
98    439.341405
99    127.062611
Length: 100, dtype: float64

In [11]:
# a ii)
top_three=

SyntaxError: invalid syntax (432330706.py, line 2)

In [ ]:
# a) iii)
plt.figure(figsize=(10, 6))
sns.lineplot(x='Total Sales Revenue', y='Time', data=df) 
plt.title('Total Sales Revenu Over Time')
plt.xlabel('Total Sales Revenu')
plt.ylabel('Time')
plt.show()